In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/Amazon_Unlocked_Mobile.csv')
df.head()

                                        Product Name  ... Review Votes
0  "CLEAR CLEAN ESN" Sprint EPIC 4G Galaxy SPH-D7...  ...          1.0
1  "CLEAR CLEAN ESN" Sprint EPIC 4G Galaxy SPH-D7...  ...          0.0
2  "CLEAR CLEAN ESN" Sprint EPIC 4G Galaxy SPH-D7...  ...          0.0
3  "CLEAR CLEAN ESN" Sprint EPIC 4G Galaxy SPH-D7...  ...          0.0
4  "CLEAR CLEAN ESN" Sprint EPIC 4G Galaxy SPH-D7...  ...          0.0

[5 rows x 6 columns]

In [ ]:
len(df)

413840

In [ ]:
df1 = df.sample(frac=1).head(100000)

In [ ]:
df1.head()

                                             Product Name  ... Review Votes
142770           BLU Studio 6.0 Unlocked Cellphone, White  ...          0.0
13904                 Apple iPhone 4S 32GB (Black) - AT&T  ...          0.0
391197  Sony Xperia TL LT30at 16GB 4G LTE Unlocked GSM...  ...          0.0
262220  Nokia Asha 306 Unlocked GSM Quad-Band Phone wi...  ...          4.0
173398  CNPGD All-in-1 Watch Cell Phone & Smart Watch ...  ...          0.0

[5 rows x 6 columns]

In [ ]:
df1 = df1.drop(['Product Name', 'Brand Name', 'Price', 'Review Votes'], axis=1)

In [ ]:
df1.head()

        Rating                                            Reviews
142770       5                                 is the best phone.
13904        1  I was really excited to get this new iPhone si...
391197       1                          Worse phone i ever bought
262220       5  Item arrived very original unopened packaging ...
173398       2  Didn't know that had to get a whole new number...

In [ ]:
df1['label'] = df1['Rating'].apply(lambda c: 1 if c >3 else (0 if c<3 else 'neut'))
df1.head()

        Rating                                            Reviews label
142770       5                                 is the best phone.     1
13904        1  I was really excited to get this new iPhone si...     0
391197       1                          Worse phone i ever bought     0
262220       5  Item arrived very original unopened packaging ...     1
173398       2  Didn't know that had to get a whole new number...     0

In [ ]:
df1 = df1.drop(['Rating'], axis=1)

In [ ]:
df1 = df1[df1['label'] != 'neut']
len(df1)

92321

In [ ]:
df1.head()

                                                  Reviews label
142770                                 is the best phone.     1
13904   I was really excited to get this new iPhone si...     0
391197                          Worse phone i ever bought     0
262220  Item arrived very original unopened packaging ...     1
173398  Didn't know that had to get a whole new number...     0

In [ ]:
import numpy as np
df1['Reviews'].isnull().values.any()

True

In [ ]:
df1 = df1.replace(np.nan, '', regex=True)
df1['Reviews'].isnull().values.any()

False

In [ ]:
df1.head()

                                                  Reviews  label
142770                                 is the best phone.      1
13904   I was really excited to get this new iPhone si...      0
391197                          Worse phone i ever bought      0
262220  Item arrived very original unopened packaging ...      1
173398  Didn't know that had to get a whole new number...      0

In [ ]:
def get_top_data(top_n):
    top_data_df_positive = df1[df1['label'] == 1].head(top_n)
    top_data_df_negative = df1[df1['label'] == 0].head(top_n)
    top_data_df_small = pd.concat([top_data_df_positive, top_data_df_negative])
    return top_data_df_small

**FINAL DATASET TO BE USED**

In [ ]:
# Function call to get the top 30000 from each sentiment
df1 = get_top_data(top_n=30000)

# After selecting top few samples of each sentiment
print("After segregating and taking equal number of rows for each sentiment:")
print(df1['label'].value_counts())
df1.head(10)

After segregating and taking equal number of rows for each sentiment:
1    30000
0    23427
Name: label, dtype: int64

                                                  Reviews  label
142770                                 is the best phone.      1
262220  Item arrived very original unopened packaging ...      1
96184   Muy bueno el teléfono, cómodo, versátil y libe...      1
34393   The Phone came unlocked & its a sweet surprise...      1
49491   The seller exaggerated the quality a bit of th...      1
98224                                    Love blackberry.      1
118288  Excellent device. Almost no glitches. Battery ...      1
54410                                          Good is ok      1
39486   I really like this phone, the battery life is ...      1
170996  Yes I did I like it alot everything works only...      1

**PRE-PROCESSING**

In [ ]:
import nltk
nltk.download('stopwords')

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Unzipping corpora/stopwords.zip.

True

In [ ]:
import re
import pandas as pd
from nltk.corpus import stopwords
from wordcloud import WordCloud, STOPWORDS
import spacy

In [ ]:
nlp = spacy.load('en', disable=['parser', 'ner'])

In [ ]:
df1['Reviews'] = df1['Reviews'].apply(lambda x: " ".join(x.lower() for x in x.split()))
df1.head()

                                                  Reviews  label
142770                                 is the best phone.      1
262220  item arrived very original unopened packaging ...      1
96184   muy bueno el teléfono, cómodo, versátil y libe...      1
34393   the phone came unlocked & its a sweet surprise...      1
49491   the seller exaggerated the quality a bit of th...      1

In [ ]:
df1['Reviews'] = df1['Reviews'].str.replace('[^\w\s]','')
df1.head()

                                                  Reviews  label
142770                                  is the best phone      1
262220  item arrived very original unopened packaging ...      1
96184   muy bueno el teléfono cómodo versátil y libera...      1
34393   the phone came unlocked  its a sweet surprise ...      1
49491   the seller exaggerated the quality a bit of th...      1

In [ ]:
stop = stopwords.words('english')
df1['Reviews'] = df1['Reviews'].apply(lambda x: " ".join(x for x in x.split() if x not in stop))
df1.head()

                                                  Reviews  label
142770                                         best phone      1
262220  item arrived original unopened packaging demon...      1
96184   muy bueno el teléfono cómodo versátil liberado...      1
34393            phone came unlocked sweet surprise price      1
49491   seller exaggerated quality bit product still e...      1

In [ ]:
def space(comment):
    doc = nlp(comment)
    return " ".join([token.lemma_ for token in doc])

In [ ]:
df1['Reviews']= df1['Reviews'].apply(space)

In [ ]:
df1.head()

                                                  Reviews  label
142770                                         good phone      1
262220  item arrive original unopened packaging demons...      1
96184   muy bueno el teléfono cómodo versátil liberado...      1
34393            phone come unlocked sweet surprise price      1
49491   seller exaggerated quality bit product still e...      1

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df1.Reviews, df1.label, test_size=0.2, random_state=32)

In [ ]:
from sklearn.feature_extraction.text import TfidfVectorizer
# Create feature vectors
vectorizer = TfidfVectorizer(min_df = 5,
                             max_df = 0.8,
                             sublinear_tf = True,
                             use_idf = True)
train_vectors = vectorizer.fit_transform(X_train)
test_vectors = vectorizer.transform(X_test)

In [ ]:
import time
from sklearn import svm
from sklearn.metrics import classification_report
# Perform classification with SVM, kernel=linear
classifier_linear = svm.SVC(kernel='linear')
t0 = time.time()
classifier_linear.fit(train_vectors, y_train)
t1 = time.time()
prediction_linear = classifier_linear.predict(test_vectors)
t2 = time.time()
time_linear_train = t1-t0
time_linear_predict = t2-t1
# results
print("Training time: %fs; Prediction time: %fs" % (time_linear_train, time_linear_predict))

Training time: 132.440863s; Prediction time: 15.659589s

In [ ]:
print(classification_report(y_test,prediction_linear))

              precision    recall  f1-score   support

           0       0.89      0.91      0.90      4626
           1       0.93      0.91      0.92      6060

    accuracy                           0.91     10686
   macro avg       0.91      0.91      0.91     10686
weighted avg       0.91      0.91      0.91     10686